{
	"id": "ptbr",
	"navbarMenu": {
		"labelHome": "ACCUEIL",
		"labelServices": "MES DOMAINES",
		"labelAboutMe": "À PROPOS DE MOI",
		"labelPortifolio": "PROJETS",
		"labelExperience": "EXPÉRIENCE"
	},
	"landingPage": {
		"apresentationText": "Bonjour,",
		"firstTypeText": "le développeur dont vous avez besoin...",
		"secondTypeText": "Aziz Lachtar",
		"resumeText":"Je suis un ingénieur logiciel Full Stack passionné, qui aime transformer des idées complexes en solutions numériques fluides et efficaces. Avec une solide expertise en développement logiciel, je prends plaisir à concevoir des systèmes performants et intuitifs. Que ce soit en relevant des défis en ingénierie des données ou en développant des applications web dynamiques, ma curiosité et ma volonté de créer un impact significatif guident mon approche. Au-delà du code, je considère chaque projet comme une opportunité d'innover, d'apprendre et de contribuer à un monde technologique en constante évolution.",
		"buttonText": "En savoir plus"
	},
	"servicesOffer": {
		"title": "Mes domaines",
		"cards": {
			"bigData": {
				"title": "Big Data",
				"contentText":"Je possède une compréhension approfondie des techniques de gestion, d'analyse et de visualisation des données, permettant aux organisations de tirer des insights exploitables de vastes ensembles de données diversifiés. En utilisant des outils et des plateformes tels que Hadoop, Spark et Apache Kafka, je conçois et mets en œuvre des pipelines de données évolutifs qui traitent, transforment et analysent efficacement les données en temps réel."
			},
			"softwareDevelopment": {
				"title": "Développement logiciel",
				"contentText": "Je suis capable de conceptualiser, concevoir et mettre en œuvre des solutions logicielles qui répondent à des défis commerciaux complexes. Avec une maîtrise de plusieurs langages de programmation tels que Python, Java et C++, j'ai développé une gamme diversifiée d'applications, allant des systèmes d'entreprise aux applications mobiles, en utilisant les meilleures pratiques en ingénierie logicielle et les méthodologies agiles tout au long du cycle de développement."
			},
			"webDevelopment": {
				"title": "Développement Web",
				"contentText": "Je me spécialise dans la création de sites web visuellement captivants avec une fonctionnalité fluide sur toutes les plateformes. Compétent en HTML5, CSS3 et JavaScript, je crée des interfaces utilisateur engageantes qui laissent une impression durable. Mon expertise s'étend également au développement back-end en utilisant des frameworks comme SpringBoot et .NET, garantissant des applications web robustes et évolutives adaptées aux besoins des clients."
			},
			"devOps": {
				"title": "DevOps",
				"contentText": "Compétent en automatisation et intégration des processus entre le développement logiciel et les opérations IT. Maîtrise les pipelines CI/CD et la conteneurisation avec Docker."
			}
		}
	},
	"aboutMePage": {
		"title": "À PROPOS DE MOI",
		"paragraph_one": "Je suis un ingénieur logiciel avec une expertise en développement Full Stack et en analyse de données. Au fil de mon parcours, j'ai construit une solide base en programmation, en conception de systèmes et en gestion de projets. Ma passion réside dans la création de solutions logicielles impactantes, la résolution de défis complexes en ingénierie des données et le développement d'applications web innovantes. Porté par une curiosité insatiable et un engagement envers l'excellence, je m'efforce continuellement d'apprendre, d'innover et de contribuer de manière significative à l'évolution constante du monde technologique.",
		"github_card": {
			"bio": "🧑‍💻 génie logiciel",
			"bio1": "📚 Ingénierie des logiciels et des données.",
			"bio2": "PROJET",
			"followers": "Abonnés",
			"following": "Abonnements",
			"repos": "Dépôts"
		},
		"pdf": "curriculoPTBR",
		"alt_dev_img": "Aziz Lachtar"
	},
	"portifolioPage": {
		"title": "PROJETS",
		"labelFilter": "TOUS",
		"createdLabel": "Créé à",
		"projects": {
			"id_1": {
				"title": "IoT_Traffic_Monitor",
				"description": "La surveillance des données de trafic exploite les données IoT en temps réel des véhicules connectés pour surveiller le trafic sur différentes routes. Elle se compose de trois applications Maven autonomes écrites en Java : le producteur de données IoT, le processeur de données IoT et le tableau de bord des données IoT. Chaque module a un objectif spécifique dans le traitement et la présentation des données de trafic pour l'analyse et la visualisation. Le projet utilise Apache Kafka pour le streaming de messages, Spark Streaming pour le traitement des données, Cassandra pour le stockage des données, et Spring Boot pour le développement d'applications web."
			},
			"id_2": {
				"title": "StreamAggSync",
				"description":"StreamAggSync est un système de traitement de données piloté par événements conçu pour interagir en temps réel avec une plateforme bancaire en ligne. Ce système consomme des données provenant de sujets Kafka générés lors de la simulation d'événements bancaires dans l'environnement bancaire. Il exploite Spark Structured Streaming pour une consommation efficace des messages Kafka, une agrégation intelligente et le stockage des données agrégées dans des bases de données PostgreSQL. Le projet vise à faciliter l'analyse en temps réel et le stockage fiable de données provenant de divers sujets Kafka, spécifiquement dans le domaine de la réglementation bancaire et de la gestion des risques."
			},
			"id_3": {
				"title": "Event-driven Banking Data Producer",
				"description":"L'Event-driven Banking Data Producer est une application basée sur Java construite avec Spring Boot et Apache Kafka. Elle agit en tant que producteur Kafka, générant des données liées aux opérations bancaires telles que les informations sur les comptes, les détails des clients, les soldes des comptes et les transactions. L'application fournit des API pour la consommation et le stockage des données dans des sujets Kafka, créant dynamiquement des sujets pour chaque modèle de données."
			},
			"id_4": {
				"title": "E-Commerce App with Microservices Architecture",
				"description":"L'application E-Commerce est une application évolutive et résiliente construite avec une architecture de microservices utilisant Java Spring Boot. Elle se compose de plusieurs modules, dont une passerelle API, un service de découverte, un service d'inventaire, un service de notification utilisant Apache Kafka pour le streaming de données asynchrone en temps réel et la gestion des événements. L'application garantit une communication transparente entre les microservices et une disponibilité élevée en utilisant Netflix Eureka."
			},
			"id_5": {
				"title": "Bank Management System",
				"description":"Le système de gestion bancaire est une application sécurisée et efficace conçue pour faciliter les interactions entre les employés de la banque et les clients dans un environnement bancaire. Il est construit sur l'architecture Modèle-Vue-Contrôleur (MVC) en utilisant ASP.NET Core MVC avec C# et des pages Razor. Le système assure une sécurité robuste et une authentification en utilisant ASP.NET Core Identity."
			},

			"id_6": {
				"title": "Cafe Management System - Backend",
				"description":"Le backend du système de gestion de café est construit en Java et Spring Boot, offrant des fonctionnalités robustes pour la gestion des catégories de produits, la génération de factures et la mise en œuvre de l'authentification et de l'autorisation sécurisées. Il garantit une manipulation et un traitement efficaces des données, répondant aux besoins des propriétaires ou gestionnaires de cafés."
			},
			"id_7": {
				"title": "Cafe Management System - Frontend",
				"description":"Le frontend du système de gestion de café est construit avec Angular, offrant une interface utilisateur intuitive pour une gestion efficace des produits et le traitement des commandes. Il offre une expérience fluide aux propriétaires ou gestionnaires de cafés pour interagir avec le système, facilitant la navigation et l'accès aux fonctionnalités clés."
			},
			"id_8": {
				"title": "Search Engine App",
				"description":"L'application de moteur de recherche en C++ est un outil complet conçu pour indexer et rechercher efficacement à travers plusieurs fichiers. Elle se compose de divers composants, y compris un lecteur de fichiers, un analyseur, un générateur de statistiques, un indexeur, un ordonnanceur et un moteur de recherche. Ce projet vise à concevoir un système de recherche pour récupérer et afficher des résultats de recherche précieux à partir de documents étendus, en appliquant la programmation orientée objet pour améliorer la modularité, la maintenabilité et la réutilisabilité du code."
			},
			"id_9": {
				"title": "Algorithmes bio-inspirés",
				"description": "Ce projet de recherche a porté sur les algorithmes bio-inspirés, explorant des méthodes computationnelles issues de processus naturels tels que l'évolution, l'intelligence collective et les systèmes biologiques. L'étude a examiné des techniques comme les algorithmes génétiques, l'optimisation par essaims particulaires et l'optimisation par colonies de fourmis, en les appliquant à des problèmes d'optimisation complexes, mettant en évidence leur potentiel pour améliorer l'efficacité et l'adaptabilité dans divers domaines."
			},
			"id_10": {
				"title": "Développement d’un système de  reconnaissance des états émotionnels  par analyse des données physiologiques  et apprentissage machine.",
				"description": "Ce projet consiste à développer un système capable de reconnaître les états émotionnels à partir de données physiologiques, telles que le rythme cardiaque et la conductance de la peau. En utilisant des algorithmes d'apprentissage machine, le système analyse les schémas dans les données pour classifier les émotions, avec pour objectif d'améliorer les interactions homme-machine et de fournir des informations sur le bien-être émotionnel."
			}
		}
	},
	"experiencePage": {
		"title": "EXPÉRIENCE",
		"timeline": {
			"labelPosition": "Poste",
			"doca": "Stagiaire ingenieur logiciel JAVA",
			"doca": "Stagiaire ingenieur JAVA",
			"vermeg": "Stagiaire ingénierie des logiciels et des données",
			"stb": "Stagiare en développement Web",
			"labelTitle": "Domaine d'études",
			"labelCompany": "Entreprise",
			"labelCategory": "Diplôme",
			"labelInstitution": "École",
			"labelProfessionalCourse": "Institution",
			"labelBachelorDegree": "Diplôme d'Ingénieur",
			"labelExtensionCourse": "Cours de perfectionnement",
			"labelBachelor": "Baccalauréat",
			"fieldofstudy": "Physiques - Chimie",
			"ensit": " Ecole Nationale d'ingénieurs de Tunis",
			"ipeit": "Institut Préparatoire aux Etudes d'Ingénieurs de Tunis",
			"fieldensit": "Génie informatique",
			"bacfield": "Sciences expérimentales"


		}
	},
	"footer": {
		"labelNavigation": {
			"title": "NAVIGATION",
			"labelHome": "Accueil",
			"labelServices": "Services",
			"labelAboutMe": "À propos de moi",
			"labelPortifolio": "Projets",
			"labelExperience": "Expérience"
		},
		"labelHost": {
			"title": "HÉBERGEMENT DU SITE WEB"
		},
		"labelSourceCode": {
			"title": "CODE SOURCE"
		},
		"labelTechs": {
			"title": "TECHNOLOGIES"
		},
		"labelStats": {
			"title": "STATISTIQUES",
			"stats": "Tableau de bord"
		},
		"labelBuildVersion": "Version de construction"
	}
}
